app/controllers/item_pedidos_controller.rb

SELECT * FROM "item_pedidos"
---
  def index
    @item_pedidos = ItemPedido.all

SELECT * FROM "item_pedidos" WHERE ("item_pedidos"."id" = 1)
---
  def edit
    @item_pedido = ItemPedido.find(params[:id])

INSERT INTO "item_pedidos" ("valor_tabela", "created_at", "produto_id", "pedido_id", "valor_venda", "updated_at", "desconto", "emissao_relatorio", "quantidade") VALUES(1000.0, '2009-07-13 19:19:09.943774', 1, 25, 226.0, '2009-07-13 19:19:09.943774', 22.57, NULL, 1.0) RETURNING "id"
---
  def create
    @item_pedido = ItemPedido.new(params[:item_pedido])
    @item_pedido.valor_tabela = @item_pedido.produto.valor_normal

    respond_to do |format|
      if @item_pedido.save

SELECT * FROM "item_pedidos" WHERE ("item_pedidos".pedido_id = 21)
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
UPDATE "item_pedidos" SET "updated_at" = '2009-07-06 12:48:03.355932', "valor_tabela" = 1000.0, "desconto" = 5.0, "valor_venda" = 950.0 WHERE "id" = 1
UPDATE "pedidos" SET "updated_at" = '2009-07-06 12:48:03.438839', "percentual_comissao" = 5.05050505050505, "valor" = 1039.5, "valor_normal" = 1100.23 WHERE "id" = 21
---
  def update
    @item_pedido = ItemPedido.find(params[:id])
    respond_to do |format|
      if @item_pedido.update_attributes(params[:item_pedido])

SELECT * FROM "produtos"
---
  def load_produtos
    @produtos = Produto.all.collect { |p| [p.descricao , p.id] }