app/controllers/notas_fiscais_controller.rb

  def show
    @nota_fiscal = NotaFiscal.find(params[:id])
---
SELECT * FROM "itens_nota_fiscal" WHERE ("itens_nota_fiscal".nota_fiscal_id = 1)