app/controllers/pedidos_controller.rb

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
SELECT count(*) AS count_all FROM "pedidos"
---
  def index

 	@pedidos = Pedido.find(:all, :include => [:cliente], :offset => params[:start], :limit => params[:limit] )
	puts "*********"
	puts @pedidos[0].cliente.razao_social
	puts "*********"
    @dto = Hash.new
    @dto[:total] = Pedido.count

SELECT * FROM "item_pedidos" WHERE ("item_pedidos".pedido_id = 21)
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
---
  def show
    @pedido = Pedido.find(params[:id])

SELECT * FROM "item_pedidos" WHERE ("item_pedidos".pedido_id = 31)
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
---
  def edit
    @pedido = Pedido.find(params[:id])

INSERT INTO "pedidos" ("funcionario_estorno_id", "tipo", "roteiro_entrega_id", "data", "minuta_id", "created_at", "data_estorno", "uf_entrega", "autorizador_id", "gera_minuta", "nome_comprador", "autorizador_desconto_id", "updated_at", "plano_de_pagamento", "comissao_telemarketing", "entrega", "programacao", "cliente_id", "valor", "desconto", "endereco_entrega", "area_id", "desconto_complementar", "valor_normal", "nosso_numero", "observacao", "total_desconto_item", "loja_origem_id", "loja_destino_id", "operador_id", "percentual_comissao", "operador_estorno_id", "comissao_vendedor", "cep_entrega", "previsao_entrega", "vendedor_id", "registro", "empresa_id", "bairro_entrega", "status", "especial", "data_aprovacao_pedido", "status_estorno", "cidade_entrega_id", "area_entrega_id", "acrescimo", "transportadora_id", "telemarketing_id", "venda_externa", "identificador_venda", "regiao_entrega_id") VALUES(NULL, E'I', NULL, '2009-06-24', NULL, '2009-07-27 18:33:39.984447', NULL, NULL, 1, 't', E'magno', NULL, '2009-07-27 18:33:39.984447', E'000030060', 0.0, '2009-06-30', '2009-06-30', 1, 0.0, 0.0, E'', NULL, 0.0, 0.0, E'789', E'', 0.0, NULL, NULL, 1, -1.0, NULL, 0.0, NULL, '2009-06-30', 1, NULL, NULL, NULL, E'', NULL, NULL, 'f', NULL, NULL, 0.0, NULL, NULL, 'f', NULL, NULL) RETURNING "id"
---
  def create
    @pedido = Pedido.new(params[:pedido])

    @pedido.operador_id = 1 # Deverá vir na session (lembrar de arrumar depois)
    respond_to do |format|
      if @pedido.save

SELECT * FROM "item_pedidos" WHERE ("item_pedidos".pedido_id = 21)
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
UPDATE "pedidos" SET "updated_at" = '2009-07-06 13:06:22.643212', "percentual_comissao" = 4.35051020408163, "valor" = 392.0, "desconto" = 2.0 WHERE "id" = 21
---
  def update
    @pedido = Pedido.find(params[:id])

    respond_to do |format|
      if @pedido.update_attributes(params[:pedido])

SELECT * FROM "item_pedidos" WHERE ("item_pedidos".pedido_id = 21)
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
UPDATE "pedidos" SET "updated_at" = '2009-07-28 17:24:25.582348', "percentual_comissao" = 4.49730320699708, "valor" = 343.0, "status" = E'Aprovado', "data_aprovacao_pedido" = '2009-07-28', "valor_normal" = 444.0 WHERE "id" = 21
---
  def aprovar
    @pedido = Pedido.find(params[:id])
    @pedido.data_aprovacao_pedido = Date.today
    @pedido.autorizador = current_user
    @pedido.status = 'Aprovado'
    respond_to do |format|
      if @pedido.save

SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
---
  def permitir_desconto_no_pedido
    @pedido = Pedido.find(params[:id])

SELECT * FROM "item_pedidos" WHERE ("item_pedidos".pedido_id = 21)
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 21)
---
  def impressao
    @pedido = Pedido.find(params[:id])