app/controllers/pedidos_de_assistencia_controller.rb

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
SELECT count(*) AS count_all FROM "pedidos_de_assistencia"
---
  def index

 	@pedidos_de_assistencia = PedidoDeAssistencia.find(:all, :include => [:cliente], :offset => params[:start], :limit => params[:limit] )
    @dto = Hash.new
    @dto[:total] = PedidoDeAssistencia.count

SELECT * FROM "itens_pedido_de_assistencia" WHERE ("itens_pedido_de_assistencia".pedido_de_assistencia_id = 1)
SELECT * FROM "pedidos_de_assistencia" WHERE ("pedidos_de_assistencia"."id" = 1)
---
  def show
    @pedido_de_assistencia = PedidoDeAssistencia.find(params[:id])

SELECT * FROM "pedidos_de_assistencia" WHERE ("pedidos_de_assistencia"."id" = 1)
---
  def edit
    @pedido_de_assistencia = PedidoDeAssistencia.find(params[:id])

INSERT INTO "pedidos_de_assistencia" ("funcionario_estorno_id", "tipo", "data", "minuta_id", "data_estorno", "created_at", "autorizador_id", "gera_minuta", "nome_comprador", "autorizador_desconto_id", "plano_de_pagamento", "updated_at", "entrega", "programacao", "cliente_id", "valor", "desconto", "endereco_entrega", "area_id", "desconto_complementar", "valor_normal", "nosso_numero", "observacao", "total_desconto_item", "operador_id", "operador_estorno_id", "previsao_entrega", "vendedor_id", "registro", "empresa_id", "status", "status_estorno", "acrescimo", "transportadora_id", "telemarketing_id", "venda_externa", "identificador_venda") VALUES(NULL, E'I', '2009-07-07', NULL, NULL, '2009-07-08 13:04:59.951218', 1, 't', E'magno', NULL, E'000030', '2009-07-08 13:04:59.951218', '2009-07-07', '2009-07-07', 1, 0.0, 0.0, E'', NULL, 0.0, 0.0, E'112233', E'', 0.0, NULL, NULL, '2009-07-07', 1, NULL, NULL, E'', NULL, 0.0, NULL, NULL, 'f', NULL) RETURNING "id"
---
  def create
    @pedido_de_assistencia = PedidoDeAssistencia.new(params[:pedido_de_assistencia])

    @pedido_de_assistencia.operador_id = current_user.id # Deverá vir na session
    respond_to do |format|
      if @pedido_de_assistencia.save

SELECT * FROM "pedidos_de_assistencia" WHERE ("pedidos_de_assistencia"."id" = 1)
---
  def update
    @pedido_de_assistencia = PedidoDeAssistencia.find(params[:id])